In [2]:
import pandas as pd

In [12]:
data = [
    {'Name': 'Alice', 'Age': 25, 'Job': 'Engineer'},
    {'Name': 'Bob', 'Age': 30, 'Job': 'Data Scientist'},
    {'Name': 'Charlie', 'Age': 28, 'Job': 'Analyst'},
    {'Name': 'Charlie', 'Age': 28, 'Job': 'Pale'}
]

df = pd.DataFrame(data)
print(df)

      Name  Age             Job
0    Alice   25        Engineer
1      Bob   30  Data Scientist
2  Charlie   28         Analyst
3  Charlie   28            Pale

In [14]:
output = df[df['Name']=="Charlie"]
output = df[df['Job']=="Pale"]
output

      Name  Age   Job
3  Charlie   28  Pale

In [15]:
data = [
    {'name': 'Piper', 'salary': 4548},
    {'name':'Grace','salary':28150},
    {'name':'Georgia','salary':1103},
    {'name':"Willow",'salary':6593},
    {'name':'Finn','salary':74576},
    {'name':"Thomas",'salary':24433}, 
]

In [16]:
df = pd.DataFrame(data)

In [17]:
df

      name  salary
0    Piper    4548
1    Grace   28150
2  Georgia    1103
3   Willow    6593
4     Finn   74576
5   Thomas   24433

In [18]:
df["Bonus"] = 2*df["salary"]
df

      name  salary   Bonus
0    Piper    4548    9096
1    Grace   28150   56300
2  Georgia    1103    2206
3   Willow    6593   13186
4     Finn   74576  149152
5   Thomas   24433   48866

In [28]:
data = [
   {"customer_id":1,"name":"Ella","email":"emily@example.com"},
   {"customer_id":2,"name":"David","email":"michael@example.com"},
   {"customer_id":3,"name":"Zachary","email":"sarah@example.com"},
   {"customer_id":4,"name":"Alice ","email":"john@example.com"},
   {"customer_id":5,"name":"Finn","email":"john@example.com"},
   {"customer_id":6,"name":"Violet","email":"alice@example.com"}
]

In [43]:
df = pd.DataFrame(data)
df['email'] = df['email'].drop_duplicates()
df.dropna(inplace=True)
df

   customer_id     name                email
0            1     Ella    emily@example.com
1            2    David  michael@example.com
2            3  Zachary    sarah@example.com
3            4   Alice      john@example.com
5            6   Violet    alice@example.com

   customer_id     name                email
0            1     Ella    emily@example.com
1            2    David  michael@example.com
2            3  Zachary    sarah@example.com
3            4   Alice      john@example.com
4            5     Finn     john@example.com
5            6   Violet    alice@example.com

TypeError: 'NoneType' object is not subscriptable

In [31]:
df = df.drop_duplicates(inplace=True)
df

In [ ]:
+-------------+---------+---------------------+
| customer_id | name    | email               |
+-------------+---------+---------------------+
| 1           | Ella    | emily@example.com   |
| 2           | David   | michael@example.com |
| 3           | Zachary | sarah@example.com   |
| 4           | Alice   | john@example.com    |
| 5           | Finn    | john@example.com    |
| 6           | Violet  | alice@example.com   |
+-------------+---------+---------------------+

In [ ]:
| name    | salary |
+---------+--------+
| Piper   | 4548   |
| Grace   | 28150  |
| Georgia | 1103   |
| Willow  | 6593   |
| Finn    | 74576  |
| Thomas  | 24433  |
+---------+--------